# CanApplyPresentationMode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..CanApplyPresentationMode Method
RebarContainer Class See Also
---
Checks if a presentation mode can be applied for this RebarContainer in the given view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanApplyPresentationMode(
	View dBView
)
```

Visual Basic
---
```text
Public Function CanApplyPresentationMode ( _
	dBView As View _
) As Boolean
```

Visual C++
---
```text
public:
bool CanApplyPresentationMode(
	View^ dBView
)
```

# ### Parameters
dBView
    Type: Autodesk.Revit.DB..::..View The view in which presentation mode will be applied.
# ### Return Value
True if presentation mode can be applied for this view, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace